Revit 2027 API
ParameterTypeId.GridCenterSegmentStyle Property
 "Center Segment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GridCenterSegmentStyle { get; }
Public Shared ReadOnly Property GridCenterSegmentStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GridCenterSegmentStyle {
	ForgeTypeId^ get ();
}
static member GridCenterSegmentStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace